Repository: GmalFari/react-fluent-motion-web
Catalog: locales/*/messages.po
Languages: ar

source: Modern React App
ar: تطبيق React حديث

source: Next Generation
ar: الجيل القادم

source: React Application
ar: تطبيق React

source: Built with cutting-edge technologies including React Router v7, SSR, internationalization, and advanced performance optimizations
ar: مبني بأحدث التقنيات بما في ذلك React Router v7 و SSR والدولية وتحسينات الأداء المتقدمة

source: Explore Features
ar: استكشف الميزات

source: Powerful Features
ar: ميزات قوية

source: Everything you need for a modern, high-performance web application
ar: كل ما تحتاجه لتطبيق ويب حديث وعالي الأداء

source: High Performance
ar: أداء عالي

source: Optimized for speed with advanced bundling and caching strategies
ar: محسّن للسرعة مع استراتيجيات التجميع والتخزين المؤقت المتقدمة

source: Internationalization
ar: التدويل

source: Full support for Arabic and English with RTL layout
ar: دعم كامل للعربية والإنجليزية مع تخطيط RTL

source: Modern Stack
ar: مجموعة تقنيات حديثة

source: React Router v7, TypeScript, Vite, and Tailwind CSS
ar: React Router v7 و TypeScript و Vite و Tailwind CSS

source: Beautiful UI
ar: واجهة مستخدم جميلة

source: Smooth animations with Framer Motion and modern design
ar: رسوم متحركة سلسة مع Framer Motion وتصميم حديث

source: Production Ready
ar: جاهز للإنتاج

source: SSR, PWA, and Cloudflare deployment ready
ar: جاهز لـ SSR و PWA ونشر Cloudflare

source: Performance Metrics
ar: مقاييس الأداء

source: Real-time performance data from your current session
ar: بيانات الأداء في الوقت الفعلي من جلستك الحالية

source: Back to Home
ar: العودة للرئيسية

source: Technical Features
ar: الميزات التقنية

source: Comprehensive overview of all the modern technologies and optimizations integrated into this application
ar: نظرة عامة شاملة على جميع التقنيات الحديثة والتحسينات المدمجة في هذا التطبيق

source: Core Technologies
ar: التقنيات الأساسية

source: Performance Optimizations
ar: تحسينات الأداء

source: Ready for Production
ar: جاهز للإنتاج

source: This application is optimized for deployment on Cloudflare Workers with full SSR support and edge computing capabilities
ar: هذا التطبيق محسّن للنشر على Cloudflare Workers مع دعم SSR الكامل وقدرات الحوسبة الطرفية

source: Get Started
ar: ابدأ الآن
